app/controllers/admin/event_submissions_controller.rb

  def show
    @detail = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

  def update
    @events = Event.showall
    @detail = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]