app/controllers/admin/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    @profil = User.find(params['id'])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def edit

    @detail = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "description" = $1, "first_name" = $2, "last_name" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["description", "miaou"], ["first_name", "Bounty"], ["last_name", "Lechat"], ["updated_at", "2019-11-10 16:12:46.603809"], ["id", 12]]
---
  def update

    @users = User.showall
    @detail = User.find(params[:id])

    user_params= params.require(:user).permit(:email,:description,:first_name,:last_name,:is_admin)
      if @detail.update(user_params) # essaie de sauvegarder en base @gossip

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]
---
  def destroy
    @detail = User.find(params['id'])
    @detail.destroy