app/controllers/events_controller.rb

  def show
    @detail = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    user=current_user

    @detail = Event.new( admin_id: user.id,
                          'title' => params[:title],
                          'description' => params[:description],
                          'start_date' => params[:start_date],
                          'duration' => params[:duration],
                          'price' => params[:price],
                          'location' => params[:location]
                        ) # avec xxx qui sont les données obtenues à partir du formulaire

      if @detail.save # essaie de sauvegarder en base @gossip
---
INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"